InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииОбъектовСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоИзменение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ИдентификаторЭДО", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТипДанных", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ИдентификаторОбъекта", "Доступность", Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "МеткаВремениВЦентреЭДО", "Видимость", ЗначениеЗаполнено(Параметры.МеткаВремениВЦентреЭДО));
	Если ЗначениеЗаполнено(Параметры.МеткаВремениВЦентреЭДО) Тогда
		МеткаВремениВЦентреЭДО = ОбщегоНазначенияБЭДКлиентСервер.ПредставлениеДатыВМиллисекундах(
			Параметры.МеткаВремениВЦентреЭДО);
	КонецЕсли;
	Если СтрДлина(МеткаВремениВЦентреЭДО) = 22 Тогда
		МеткаВремениВЦентреЭДО = СтрЗаменить(МеткаВремениВЦентреЭДО, " ", "  ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МеткаВремениПредставление = ОбщегоНазначенияБЭДКлиентСервер.ПредставлениеДатыВМиллисекундах(
		ТекущийОбъект.МеткаВремени);
	Если СтрДлина(МеткаВремениПредставление) = 22 Тогда
		МеткаВремениПредставление = СтрЗаменить(МеткаВремениПредставление, " ", "  ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МеткаВремени = ОбщегоНазначенияБЭДКлиентСервер.СтрокаВМиллисекунды(МеткаВремениПредставление);
	Если МеткаВремени <> Неопределено Тогда
		ТекущийОбъект.МеткаВремени = МеткаВремени;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщегоНазначенияБЭДКлиентСервер.ТекстСообщения(
			"Поле", "Корректность", НСтр("ru = 'Метка времени'")),
			, "МеткаВремениПредставление", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
